#### Terraform Plan 📖 `success`

<details><summary>Show Plan</summary>

```terraform
data.archive_file.lambda_package: Reading...
data.archive_file.lambda_package: Read complete after 0s [id=37c2dc9e95ff5a0ffcff569be225107065e89564]
data.aws_iam_policy_document.scheduler_assume_role: Reading...
data.aws_iam_policy_document.lambda_assume_role: Reading...
data.aws_iam_policy_document.scheduler_assume_role: Read complete after 0s [id=52247394]
data.aws_iam_policy_document.lambda_assume_role: Read complete after 0s [id=2690255455]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.cost_reporter_lambda will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "cost_reporter_lambda" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:logs:*:*:*",
            ]
        }
      + statement {
          + actions   = [
              + "ce:GetCostAndUsage",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "scheduler:CreateSchedule",
              + "scheduler:DeleteSchedule",
              + "scheduler:GetSchedule",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:scheduler:eu-west-2:*:schedule/ndx-cost-reporter/*",
            ]
        }
      + statement {
          + actions   = [
              + "iam:PassRole",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "scheduler.amazonaws.com",
                ]
              + variable = "iam:PassedToService"
            }
        }
      + statement {
          + actions   = [
              + "secretsmanager:GetSecretValue",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
    }

  # data.aws_iam_policy_document.scheduler_execution will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "scheduler_execution" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
    }

  # aws_cloudwatch_event_rule.lease_ended will be created
  + resource "aws_cloudwatch_event_rule" "lease_ended" {
      + arn            = (known after apply)
      + description    = "Triggers cost report when a sandbox lease ends"
      + event_bus_name = "default"
      + event_pattern  = jsonencode(
            {
              + detail-type = [
                  + "Lease Ended",
                  + "Lease Terminated",
                  + "Lease Expired",
                ]
              + source      = [
                  + "innovation-sandbox",
                ]
            }
        )
      + force_destroy  = false
      + id             = (known after apply)
      + name           = "ndx-cost-reporter-lease-ended"
      + name_prefix    = (known after apply)
      + region         = "eu-west-2"
      + tags_all       = {
          + "Component"   = "CostReporter"
          + "Environment" = "production"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "NDX"
        }
    }

  # aws_cloudwatch_event_target.lease_ended will be created
  + resource "aws_cloudwatch_event_target" "lease_ended" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + force_destroy  = false
      + id             = (known after apply)
      + region         = "eu-west-2"
      + rule           = "ndx-cost-reporter-lease-ended"
      + target_id      = "cost-reporter-lambda"

      + input_transformer {
          + input_paths    = {
              + "accountId"  = "$.detail.accountId"
              + "detailType" = "$.detail-type"
              + "leaseEnd"   = "$.detail.leaseEndTime"
              + "leaseId"    = "$.detail.leaseId"
              + "leaseStart" = "$.detail.leaseStartTime"
              + "userEmail"  = "$.detail.userEmail"
            }
          + input_template = <<-EOT
                {
                  "action": "SCHEDULE_COST_REPORT",
                  "accountId": <accountId>,
                  "leaseId": <leaseId>,
                  "userEmail": <userEmail>,
                  "leaseStartTime": <leaseStart>,
                  "leaseEndTime": <leaseEnd>,
                  "eventType": <detailType>
                }
            EOT
        }
    }

  # aws_cloudwatch_log_group.cost_reporter will be created
  + resource "aws_cloudwatch_log_group" "cost_reporter" {
      + arn                         = (known after apply)
      + deletion_protection_enabled = (known after apply)
      + id                          = (known after apply)
      + log_group_class             = (known after apply)
      + name                        = "/aws/lambda/ndx-cost-reporter"
      + name_prefix                 = (known after apply)
      + region                      = "eu-west-2"
      + retention_in_days           = 14
      + skip_destroy                = false
      + tags_all                    = {
          + "Component"   = "CostReporter"
          + "Environment" = "production"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "NDX"
        }
    }

  # aws_iam_role.cost_reporter_lambda will be created
  + resource "aws_iam_role" "cost_reporter_lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ndx-cost-reporter-lambda"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Component"   = "CostReporter"
          + "Environment" = "production"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "NDX"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role.scheduler_execution will be created
  + resource "aws_iam_role" "scheduler_execution" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "scheduler.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ndx-cost-reporter-scheduler"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Component"   = "CostReporter"
          + "Environment" = "production"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "NDX"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy.cost_reporter_lambda will be created
  + resource "aws_iam_role_policy" "cost_reporter_lambda" {
      + id          = (known after apply)
      + name        = "ndx-cost-reporter-lambda-policy"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = (known after apply)
    }

  # aws_iam_role_policy.scheduler_execution will be created
  + resource "aws_iam_role_policy" "scheduler_execution" {
      + id          = (known after apply)
      + name        = "ndx-cost-reporter-scheduler-policy"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = (known after apply)
    }

  # aws_lambda_function.cost_reporter will be created
  + resource "aws_lambda_function" "cost_reporter" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + description                    = "Sends cost reports to users after lease ends"
      + filename                       = "./../lambda.zip"
      + function_name                  = "ndx-cost-reporter"
      + handler                        = "handler.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 256
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "eu-west-2"
      + reserved_concurrent_executions = -1
      + response_streaming_invoke_arn  = (known after apply)
      + role                           = (known after apply)
      + runtime                        = "nodejs22.x"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "xWq8Jswl/e/17egApTe/NWyaFEnAvqWe3LK1b9W4hTg="
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "Component"   = "CostReporter"
          + "Environment" = "production"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "NDX"
        }
      + timeout                        = 60
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }
    }

  # aws_lambda_permission.eventbridge will be created
  + resource "aws_lambda_permission" "eventbridge" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "ndx-cost-reporter"
      + id                  = (known after apply)
      + principal           = "events.amazonaws.com"
      + region              = "eu-west-2"
      + source_arn          = (known after apply)
      + statement_id        = "AllowEventBridgeInvoke"
      + statement_id_prefix = (known after apply)
    }

  # aws_scheduler_schedule_group.cost_reporter will be created
  + resource "aws_scheduler_schedule_group" "cost_reporter" {
      + arn                    = (known after apply)
      + creation_date          = (known after apply)
      + id                     = (known after apply)
      + last_modification_date = (known after apply)
      + name                   = "ndx-cost-reporter"
      + name_prefix            = (known after apply)
      + region                 = "eu-west-2"
      + state                  = (known after apply)
      + tags_all               = {
          + "Component"   = "CostReporter"
          + "Environment" = "production"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "NDX"
        }
    }

  # aws_secretsmanager_secret.govuk_notify will be created
  + resource "aws_secretsmanager_secret" "govuk_notify" {
      + arn                            = (known after apply)
      + description                    = "GOV.UK Notify API key for cost report emails"
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "ndx/govuk-notify"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + region                         = "eu-west-2"
      + tags_all                       = {
          + "Component"   = "CostReporter"
          + "Environment" = "production"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "NDX"
        }
    }

Plan: 11 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + eventbridge_rule_arn    = (known after apply)
  + govuk_notify_secret_arn = (known after apply)
  + lambda_function_arn     = (known after apply)
  + lambda_function_name    = "ndx-cost-reporter"
  + lambda_role_arn         = (known after apply)
  + scheduler_group_name    = "ndx-cost-reporter"

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

*Pushed by: @gjarzebak95, Action: `pull_request`*